Revit 2027 API
BuiltInFailures.DPartFailures.DivideVolumesProfilesEdgeMatchForWidthSome Property
 Division family cannot be used with the selected edge condition for some widths of hosts
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DivideVolumesProfilesEdgeMatchForWidthSome { get; }
Public Shared ReadOnly Property DivideVolumesProfilesEdgeMatchForWidthSome As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DivideVolumesProfilesEdgeMatchForWidthSome {
	FailureDefinitionId^ get ();
}
static member DivideVolumesProfilesEdgeMatchForWidthSome : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace